pengchujin/esp8266-ai/firmware/src/main.cpp
// ESP8266 WiFi clock: shows local time plus live Claude Code / Codex CLI /
// kimi-code working status and usage quota, polled from a small bridge service
// that runs on the developer's Mac or PC (see ../mac-app/ and ../windows-app/).
//
// Display: 240x240 SPI ST7789 (TFT_eSPI). Pin mapping is set via build_flags
// in platformio.ini - edit those if your wiring differs.

#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#include <ESP8266HTTPClient.h>
#include <WiFiClient.h>
#include <WiFiManager.h>
#include <LittleFS.h>
#include <ArduinoJson.h>
#include <TFT_eSPI.h>
#include <AnimatedGIF.h>

#include "config.h"
#include "img/claude_sprite.h"
#include "img/codex_sprite.h"
#include "img/kimi_sprite.h"
#include "img/claude_logo.h"
#include "img/codex_logo.h"
#include "img/kimi_logo.h"

TFT_eSPI tft = TFT_eSPI();
ESP8266WebServer webServer(80);

// ---------- custom sprite storage (LittleFS) ----------
// Custom uploads replace the compiled-in default animation without needing a
// firmware rebuild. You POST a raw .gif straight to /sprite/claude,
// /sprite/codex or /sprite/kimi (the device serves its own upload page at "/");
// the ESP8266 decodes and rescales the GIF *on-device* (AnimatedGIF,
// line-by-line so it never needs a full-canvas buffer) into the wire format
// below, which the display path then reads back frame-by-frame:
//   [1 byte frame count][frame0 bytes][frame1 bytes]...
// Each frame is exactly <APP>_SPRITE_W x H RGB565 pixels, byte order matching
// tools/convert_sprites.py's to_rgb565() so the compiled-in defaults and custom
// uploads share one draw path.
const char *CLAUDE_SPRITE_FILE = "/c.bin";
const char *CODEX_SPRITE_FILE = "/x.bin";
const char *KIMI_SPRITE_FILE = "/k.bin";
const char *CLAUDE_GIF_FILE = "/c.gif"; // raw upload, decoded then removed
const char *CODEX_GIF_FILE = "/x.gif";
const char *KIMI_GIF_FILE = "/k.gif";
const int MAX_CUSTOM_FRAMES = 8;
const size_t CLAUDE_FRAME_BYTES = (size_t)CLAUDE_SPRITE_W * CLAUDE_SPRITE_H * 2;
const size_t CODEX_FRAME_BYTES = (size_t)CODEX_SPRITE_W * CODEX_SPRITE_H * 2;
const size_t KIMI_FRAME_BYTES = (size_t)KIMI_SPRITE_W * KIMI_SPRITE_H * 2;

// We never hold a whole sprite frame in RAM. Decoding a GIF needs ~24KB of
// heap for AnimatedGIF's own buffers, which wouldn't fit alongside a static
// full-frame buffer (a 120x120 frame is ~28KB) on the ESP8266's ~80KB. So both
// the display path and the decoder work one screen-row at a time through these
// two small scratch rows (SCREEN_W is the widest we ever need).
uint16_t rowBuf[SCREEN_W];     // current row being drawn / decoded
uint16_t prevRowBuf[SCREEN_W]; // decode only: same row from the previous frame

bool claudeCustom = false;
int claudeCustomFrames = 0;
int claudeFrame = 0;
bool codexCustom = false;
int codexCustomFrames = 0;
int codexFrame = 0;
bool kimiCustom = false;
int kimiCustomFrames = 0;
int kimiFrame = 0;
uint32_t spriteRev = 0; // bumped on upload/reset so the Mac mirror re-fetches

// Centralized metadata for each character slot: custom flags, file paths,
// compiled-in defaults and logo. Used to dispatch sprite upload/raw/reset and
// drawing without repeating the same Claude/Codex/Kimi switch everywhere.
struct SpriteSlot {
  bool *custom;
  int *customFrames;
  int *frame;
  const char *spriteFile;
  const char *gifFile;
  int defaultFrames;
  int w, h;
  const uint16_t *const *progmemFrames;
  const uint16_t *logo;
  int logoW, logoH;
  SpriteSlot(bool *c, int *cf, int *fr, const char *sf, const char *gf, int df, int w_, int h_,
             const uint16_t *const *pf, const uint16_t *lg, int lw, int lh)
      : custom(c), customFrames(cf), frame(fr), spriteFile(sf), gifFile(gf), defaultFrames(df),
        w(w_), h(h_), progmemFrames(pf), logo(lg), logoW(lw), logoH(lh) {}
};

const int SCREEN_CX = 120, SCREEN_CY = 120;
const int RING_MARGIN = 4;      // inset from screen edge
const int RING_THICKNESS = 10;  // ring bar thickness
const unsigned long ANIM_INTERVAL_MS = 120;  // sprite frame advance
const unsigned long FLASH_INTERVAL_MS = 400; // "urgent" flash speed
const unsigned long SWITCH_BOTH_MS = 2000;   // both apps working: alternate fast
const unsigned long SWITCH_IDLE_MS = 6000;   // neither working: alternate slow

enum ActiveApp { APP_CLAUDE, APP_CODEX, APP_KIMI };
ActiveApp currentApp = APP_CLAUDE;
unsigned long lastSwitchMs = 0;

// Look up the SpriteSlot metadata for a given app. Defined after the enum so
// the compiler knows ActiveApp's values.
SpriteSlot spriteSlot(ActiveApp app) {
  switch (app) {
    case APP_CLAUDE:
      return SpriteSlot(&claudeCustom, &claudeCustomFrames, &claudeFrame, CLAUDE_SPRITE_FILE,
                        CLAUDE_GIF_FILE, CLAUDE_SPRITE_FRAMES, CLAUDE_SPRITE_W, CLAUDE_SPRITE_H,
                        claude_sprite_frames, claude_logo_0, CLAUDE_LOGO_W, CLAUDE_LOGO_H);
    case APP_CODEX:
      return SpriteSlot(&codexCustom, &codexCustomFrames, &codexFrame, CODEX_SPRITE_FILE,
                        CODEX_GIF_FILE, CODEX_SPRITE_FRAMES, CODEX_SPRITE_W, CODEX_SPRITE_H,
                        codex_sprite_frames, codex_logo_0, CODEX_LOGO_W, CODEX_LOGO_H);
    default:
      return SpriteSlot(&kimiCustom, &kimiCustomFrames, &kimiFrame, KIMI_SPRITE_FILE,
                        KIMI_GIF_FILE, KIMI_SPRITE_FRAMES, KIMI_SPRITE_W, KIMI_SPRITE_H,
                        kimi_sprite_frames, kimi_logo_0, KIMI_LOGO_W, KIMI_LOGO_H);
  }
}

// Display override, settable from the Mac app via POST /api/display:
// auto = follow working status, claude/codex = pin that app on screen,
// net/music = show Mac-side telemetry pages instead of the pet.
enum DisplayMode { MODE_AUTO, MODE_CLAUDE, MODE_CODEX, MODE_KIMI, MODE_NET, MODE_MUSIC };
DisplayMode displayMode = MODE_AUTO;

// When AUTO and the Mac reports audio playing, the screen auto-switches to the
// music page and back when it stops — same spirit as the Claude/Codex auto
// switch. Only AUTO does this; a pinned mode is always honored as-is.
bool statusMusicPlaying = false;
DisplayMode lastEffectiveMode = MODE_AUTO;

// ---------- net speed mode state ----------
// Rendering is decoupled from the network: pollNet() fetches every 2s and
// only refills a queue of 250ms samples (the bridge samples at 4Hz and tags
// them with a running seq, so nothing is drawn twice or skipped). The sweep
// itself consumes exactly one queued sample every NET_DRAW_INTERVAL_MS, so
// the trace advances at a constant rate no matter how long HTTP takes.
const unsigned long NET_POLL_INTERVAL_MS = 2000; // queue refill cadence
const unsigned long NET_DRAW_INTERVAL_MS = 250;  // one chart step per bridge sample
const int NET_QUEUE = 32;
long netQRx[NET_QUEUE], netQTx[NET_QUEUE]; // ring buffer of pending samples
int netQHead = 0, netQCount = 0;
long netSeq = -1;                          // last bridge sample seq consumed into the queue
long netCurRx = 0, netCurTx = 0;           // smoothed readout for the header
unsigned long lastNetPollMs = 0;
unsigned long lastNetDrawMs = 0;
bool netChromeDrawn = false;
bool netHeaderDirty = false;

// Chart layout (task-manager style scrolling area chart, newest at the right)
const int NET_CHART_X = 8, NET_CHART_Y = 60, NET_CHART_W = 224, NET_CHART_H = 128;
long netHistRx[NET_CHART_W], netHistTx[NET_CHART_W]; // one 250ms sample per column
long netScale = 10240;    // current "nice" full-scale value (whole chart shares it)
String netLastDl, netLastUl, netLastScaleText; // change detection for partial redraws

// ---------- music mode state ----------
const int MUSIC_COVER_W = 128;
const int MUSIC_COVER_H = 128;
// Title/artist come as a Mac-rendered bitmap strip (232x44) because the
// panel fonts are ASCII-only and CJK titles would render as blanks.
const int MUSIC_TEXT_W = 232;
const int MUSIC_TEXT_H = 44;
const int MUSIC_TEXT_X = 4, MUSIC_TEXT_Y = 150;
const unsigned long MUSIC_POLL_INTERVAL_MS = 2000;
String musicTitle, musicArtist, musicAlbum;
bool musicPlaying = false;
int musicElapsed = 0, musicDuration = 0;
int musicArtworkRev = -1;
int musicTextRev = -1;
bool musicHasArtwork = false;
bool musicChromeDrawn = false;
unsigned long lastMusicPollMs = 0;

unsigned long lastAnimMs = 0;

bool flashOn = true;
unsigned long lastFlashMs = 0;

// Bridge host is not asked for during first-time WiFi setup: the Mac/Windows
// bridge discovers the device and pairs automatically (or set via /api/bridge).
String bridgeHost;

struct ClaudeStatus {
  String status = "unknown";
  long tokensToday = 0;
  int sessionMin = 0;
  int sessionWindowMin = 300;
  float fiveHourPct = -1; // real OAuth quota from the bridge, -1 = unknown
  float sevenDayPct = -1;
  bool needsInput = false; // waiting on a permission/approval prompt
};

struct CodexStatus {
  String status = "unknown";
  long tokensToday = 0;
  float primaryPct = -1;
  int primaryResetMin = -1;
  float weeklyPct = -1;
  int weeklyResetMin = -1;
  bool needsInput = false;
};

