pengchujin/esp8266-ai/firmware/src/main.cpp
  float seg = min(remaining, (float)side);
  tft.fillRect(x0, y0, (int)seg, RING_THICKNESS, color);
  remaining -= side;
  if (remaining <= 0) return;

  seg = min(remaining, (float)side);
  tft.fillRect(x1 - RING_THICKNESS, y0, RING_THICKNESS, (int)seg, color);
  remaining -= side;
  if (remaining <= 0) return;

  seg = min(remaining, (float)side);
  tft.fillRect(x1 - (int)seg, y1 - RING_THICKNESS, (int)seg, RING_THICKNESS, color);
  remaining -= side;
  if (remaining <= 0) return;

  seg = min(remaining, (float)side);
  tft.fillRect(x0, y1 - (int)seg, RING_THICKNESS, (int)seg, color);
}

void drawClaudeSprite(int frameIdx) {
  drawSpriteFrame(claudeCustom, CLAUDE_SPRITE_FILE, claude_sprite_frames, frameIdx, CLAUDE_SPRITE_W,
                  CLAUDE_SPRITE_H, CLAUDE_FRAME_BYTES);
}

void drawCodexSprite(int frameIdx) {
  drawSpriteFrame(codexCustom, CODEX_SPRITE_FILE, codex_sprite_frames, frameIdx, CODEX_SPRITE_W, CODEX_SPRITE_H,
                  CODEX_FRAME_BYTES);
}

void drawKimiSprite(int frameIdx) {
  drawSpriteFrame(kimiCustom, KIMI_SPRITE_FILE, kimi_sprite_frames, frameIdx, KIMI_SPRITE_W,
                  KIMI_SPRITE_H, KIMI_FRAME_BYTES);
}

String pctText(float pct) {
  return pct >= 0 ? String((int)pct) + "%" : "-";
}

// Two quota lines below the sprite: hourly (5h) window and weekly window.
void drawQuotaText(float hourPct, float weekPct) {
  tft.setTextDatum(TC_DATUM);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.drawString("5h " + pctText(hourPct), SCREEN_CX, 190, 2);
  tft.drawString("Weekly " + pctText(weekPct), SCREEN_CX, 208, 2);
}

// App logo in the top-left corner (inside the quota ring) so a glance tells
// which app the screen is currently showing. Drawn row-by-row from PROGMEM
// through rowBuf, same as the sprite path.
const int LOGO_X = 14, LOGO_Y = 18;

void drawAppLogo() {
  SpriteSlot s = spriteSlot(currentApp);
  for (int r = 0; r < s.logoH; r++) {
    memcpy_P(rowBuf, s.logo + (size_t)r * s.logoW, (size_t)s.logoW * 2);
    tft.pushImage(LOGO_X, LOGO_Y + r, s.logoW, 1, rowBuf);
  }
}

// Claude's ring percentage: real 5h OAuth quota from the bridge when known,
// otherwise fall back to elapsed session time as a rough stand-in.
float claudeRingPct() {
  if (claudeStatus.fiveHourPct >= 0) return claudeStatus.fiveHourPct;
  return claudeStatus.sessionWindowMin > 0
             ? (100.0 * claudeStatus.sessionMin / claudeStatus.sessionWindowMin)
             : 0;
}

// Redraws whichever app is currently active, full screen: quota ring + sprite.
void drawActiveApp() {
  tft.fillScreen(TFT_BLACK);
  if (currentApp == APP_CLAUDE) {
    drawSquareRing(claudeRingPct(), currentStatusColor());
    drawClaudeSprite(claudeFrame);
    drawQuotaText(claudeRingPct(), claudeStatus.sevenDayPct);
  } else if (currentApp == APP_CODEX) {
    drawSquareRing(max(codexStatus.primaryPct, 0.0f), currentStatusColor());
    drawCodexSprite(codexFrame);
    drawQuotaText(codexStatus.primaryPct, codexStatus.weeklyPct);
  } else {
    drawSquareRing(max(kimiStatus.fiveHourPct, 0.0f), currentStatusColor());
    drawKimiSprite(kimiFrame);
    drawQuotaText(kimiStatus.fiveHourPct, kimiStatus.sevenDayPct);
  }
  drawAppLogo();
}

// Redraws just the ring (cheap) - used for status color animation ticks
// between full redraws.
void redrawRingOnly() {
  if (currentApp == APP_CLAUDE) {
    drawSquareRing(claudeRingPct(), currentStatusColor());
  } else if (currentApp == APP_CODEX) {
    drawSquareRing(max(codexStatus.primaryPct, 0.0f), currentStatusColor());
  } else {
    drawSquareRing(max(kimiStatus.fiveHourPct, 0.0f), currentStatusColor());
  }
}

// Who gets the screen:
//   - display mode pinned (Mac app) -> that app, always
//   - exactly one app working       -> that app, immediately
//   - multiple apps working         -> alternate every SWITCH_BOTH_MS (2s)
//   - none working                  -> alternate slowly (SWITCH_IDLE_MS)
static ActiveApp nextAppInCycle(ActiveApp app) {
  return (app == APP_CLAUDE) ? APP_CODEX : (app == APP_CODEX) ? APP_KIMI : APP_CLAUDE;
}

bool updateActiveApp() {
  ActiveApp desired = currentApp;

  if (displayMode == MODE_CLAUDE) {
    desired = APP_CLAUDE;
  } else if (displayMode == MODE_CODEX) {
    desired = APP_CODEX;
  } else if (displayMode == MODE_KIMI) {
    desired = APP_KIMI;
  } else {
    // approval prompt: exactly one app waiting for input wins the screen
    int inputCount = 0;
    if (claudeStatus.needsInput) inputCount++;
    if (codexStatus.needsInput) inputCount++;
    if (kimiStatus.needsInput) inputCount++;
    if (inputCount == 1) {
      if (claudeStatus.needsInput) desired = APP_CLAUDE;
      else if (codexStatus.needsInput) desired = APP_CODEX;
      else desired = APP_KIMI;
    } else {
      bool claudeWorking = claudeStatus.status == "working";
      bool codexWorking = codexStatus.status == "working";
      bool kimiWorking = kimiStatus.status == "working";
      int workingCount = (claudeWorking ? 1 : 0) + (codexWorking ? 1 : 0) + (kimiWorking ? 1 : 0);

      if (workingCount == 1) {
        if (claudeWorking) desired = APP_CLAUDE;
        else if (codexWorking) desired = APP_CODEX;
        else desired = APP_KIMI;
      } else {
        unsigned long interval = (workingCount > 1) ? SWITCH_BOTH_MS : SWITCH_IDLE_MS;
        if (millis() - lastSwitchMs >= interval) {
          lastSwitchMs = millis();
          // rotate through the relevant set until we land on a member
          ActiveApp nextApp = nextAppInCycle(currentApp);
          if (workingCount > 1) {
            while ((nextApp == APP_CLAUDE && !claudeWorking) ||
                   (nextApp == APP_CODEX && !codexWorking) ||
                   (nextApp == APP_KIMI && !kimiWorking)) {
              nextApp = nextAppInCycle(nextApp);
            }
          }
          desired = nextApp;
        }
      }
    }
  }

  if (desired != currentApp) {
    currentApp = desired;
    lastSwitchMs = millis();
    return true;
  }
  return false;
}

// ---------- net speed screen ----------

String speedText(long bps) {
  char buf[16];
  if (bps >= 1000000) snprintf(buf, sizeof(buf), "%.1fM", bps / 1000000.0);
  else if (bps >= 1000) snprintf(buf, sizeof(buf), "%.0fK", bps / 1000.0);
  else snprintf(buf, sizeof(buf), "%ldB", bps);
  return String(buf);
}

// pushImage() colors must be pre-byte-swapped (this firmware never enables
// setSwapBytes; see the sprite pipeline). Natural RGB565 -> wire order:
inline uint16_t swap565(uint16_t c) { return (uint16_t)((c << 8) | (c >> 8)); }

void resetNetChart() {
  memset(netHistRx, 0, sizeof(netHistRx));
  memset(netHistTx, 0, sizeof(netHistTx));
  netScale = 10240;
  netLastDl = "";
  netLastUl = "";
  netLastScaleText = "";
  netQHead = 0;
  netQCount = 0;
  netSeq = -1;
}

// Full-scale steps: whole-chart shared scale snaps to the next "nice" value,
// so bar heights stay comparable and the axis label reads cleanly.
long niceNetScale(long maxV) {
  static const long steps[] = {10240,    20480,    51200,     102400,    204800,    512000,
                               1048576,  2097152,  5242880,   10485760,  20971520,  52428800,
                               104857600, 209715200, 524288000};
  for (size_t i = 0; i < sizeof(steps) / sizeof(steps[0]); i++) {
    if (maxV <= steps[i]) return steps[i];
  }
  return steps[sizeof(steps) / sizeof(steps[0]) - 1];
}

// Static chrome: labels that never change while in net mode.
void drawNetChrome() {
  tft.fillScreen(TFT_BLACK);
  tft.setTextDatum(TL_DATUM);
  tft.setTextColor(0x7BEF, TFT_BLACK);
  tft.drawString("DOWN", 14, 10, 1);
  tft.drawString("UP", 134, 10, 1);
  tft.setTextDatum(TC_DATUM);
  tft.drawString("MAC NET  -  56s", SCREEN_CX, 208, 1);
}

// Header readouts (1s-averaged), each repainted only when its text changes.
void drawNetHeaderIfChanged() {
  String dl = speedText(netCurRx) + "/s";
  String ul = speedText(netCurTx) + "/s";
  tft.setTextDatum(TL_DATUM);
  if (dl != netLastDl) {
    netLastDl = dl;
    tft.fillRect(12, 20, 116, 28, TFT_BLACK);
    tft.setTextColor(TFT_GREEN, TFT_BLACK);
    tft.drawString(dl, 12, 20, 4);
  }
  if (ul != netLastUl) {
    netLastUl = ul;
    tft.fillRect(132, 20, 108, 28, TFT_BLACK);
    tft.setTextColor(TFT_YELLOW, TFT_BLACK);
    tft.drawString(ul, 132, 20, 4);
  }
}

// Repaints the whole chart region from the sample ring, one row at a time
// through rowBuf (a single pushImage per row = no clear-then-draw flicker).
// Download is a dim-green filled area with a bright top edge; upload is a
// 2px yellow line on top; faint gridlines at 25/50/75%.
void drawNetChart() {
  static const uint16_t COL_GRID = swap565(0x2104);   // very dark grey
  static const uint16_t COL_FILL = swap565(0x02A0);   // dim green
  static const uint16_t COL_EDGE = swap565(TFT_GREEN);
  static const uint16_t COL_UL = swap565(TFT_YELLOW);
  static const uint16_t COL_BLACK = swap565(TFT_BLACK);

  long maxV = 0;
  for (int i = 0; i < NET_CHART_W; i++) {
    if (netHistRx[i] > maxV) maxV = netHistRx[i];
    if (netHistTx[i] > maxV) maxV = netHistTx[i];
  }
  netScale = niceNetScale(maxV);

  // Per-column heights (3-tap smoothed), then per-column line "bands": each
  // band spans from the previous column's height to this one's, so steep
  // rises/falls render as connected vertical strokes instead of detached
  // stair-step dots — that's what makes the undulation read as a continuous
  // line, like the Mac mirror's stroked polyline.
  static uint8_t hRx[NET_CHART_W], hTx[NET_CHART_W];
  static uint8_t dlLo[NET_CHART_W], dlHi[NET_CHART_W]; // DL edge band, incl. 3px weight
  static uint8_t ulLo[NET_CHART_W], ulHi[NET_CHART_W]; // UL line band
  const int LINE_T = 3; // stroke thickness in px
  for (int i = 0; i < NET_CHART_W; i++) {
    int lo = i > 0 ? i - 1 : 0, hi = i < NET_CHART_W - 1 ? i + 1 : NET_CHART_W - 1;
    long rx = (netHistRx[lo] + netHistRx[i] + netHistRx[hi]) / 3;
    long tx = (netHistTx[lo] + netHistTx[i] + netHistTx[hi]) / 3;
    int hr = (int)((float)rx / netScale * (NET_CHART_H - 2));
    int ht = (int)((float)tx / netScale * (NET_CHART_H - 2));
    hRx[i] = (uint8_t)constrain(hr, 0, NET_CHART_H - 1);
    hTx[i] = (uint8_t)constrain(ht, 0, NET_CHART_H - 1);
  }
  for (int i = 0; i < NET_CHART_W; i++) {
    int prevR = i > 0 ? hRx[i - 1] : hRx[0];
    int prevT = i > 0 ? hTx[i - 1] : hTx[0];
    dlHi[i] = (uint8_t)max((int)hRx[i], prevR);
    dlLo[i] = (uint8_t)max(0, min((int)hRx[i], prevR) - (LINE_T - 1));
    ulHi[i] = (uint8_t)max((int)hTx[i], prevT);
    ulLo[i] = (uint8_t)max(0, min((int)hTx[i], prevT) - (LINE_T - 1));
  }

  for (int row = 0; row < NET_CHART_H; row++) {
    int yFromBot = NET_CHART_H - 1 - row;
    bool gridRow = (row == NET_CHART_H / 4 || row == NET_CHART_H / 2 || row == 3 * NET_CHART_H / 4);
    for (int i = 0; i < NET_CHART_W; i++) {
      uint16_t c = gridRow ? COL_GRID : COL_BLACK;
      if (yFromBot <= dlHi[i] && yFromBot >= dlLo[i]) c = COL_EDGE;
      else if (yFromBot < dlLo[i]) c = COL_FILL;
      if (ulHi[i] > 0 && yFromBot <= ulHi[i] && yFromBot >= ulLo[i]) c = COL_UL;
      rowBuf[i] = c;
    }
    tft.pushImage(NET_CHART_X, NET_CHART_Y + row, NET_CHART_W, 1, rowBuf);
    if ((row & 31) == 31) yield();
  }

